#Дан список чисел, необходимо его развернуть без использования метода revese и
#функции reversed, а так же дополнительного списка и среза

spisok=[1,556,57,5,9,4]
spisok=spisok[::-1]
print(spisok)