#Пользователь вводит 3 числа, найти среднее
#арифметическое с точностью 3


a=input("введите первое число\n")
#a=int(a)
b=input("введите второе число\n")
#b=int(b)
c=input("введите третье число\n")
#c=int(c)
averege_arifmetic=(int(a)+int(b)+int(c))/3
print(f"среднее арифметическое трех чисел равно {averege_arifmetic:.3f}")
