# from task1 import summirovanie
# print(summirovanie(1, 3))

import random


# from random import randint
# x=randint(2,9)
# print(x)

#
# x = {"name" : "John", "age" : 36}
#
#
# d=" ".join(x)
# print(d)

# x = frozenset({"apple", "banana", "cherry"})
#
# #display x:
# print(x)
#
# #display the data type of x:
# print(type(x))


# numbers = tuple(i for i in range(2,10))
# print(numbers)  # Вывод: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
#
# numbers[0]=9
#
#
# for i in range(2,10):
#     print(i)
#

# i=10
#
# if i> 4:
#     print("Да больше 4")
# if i> 6:
#     print("Да больше 6")

# def summa(*args):
#
#     total = 1
#     for i in args:
#         total = total*i
#     return total
#
# print(summa(1,8,9))  # Вызов с разным количеством аргументов

# def info(**kwargs):
#     for key, value in kwargs.items():
#         print(f"{key}: {value}")
#
#
# info(имя="Алекс", возраст=30, город="Москва",пол="нет")
#
#

# Дан список содержащий в себе различные типы данных, отфильтровать таким
# образом, чтобы остались только строки, использование дополнительного списка
# незаконно


#spisok=['lll',556,5.7,{1,4},9,4,"katya",(7,9)]
#
# i=0
# while i<len(spisok):
#     if type(spisok[i])==str:
#         i+=1
#     else:
# #         del spisok[i]
# #
# # print(spisok)
#
#
# # print(spisok)
# # print(spisok[::-1])# срез дает нов список
# # spisok=spisok[::-1]
# #
# # #spisok.reverse()#сам список развернулся
# # print(spisok)
# #
# #
#
#
#





# #
#
#
#
#
#
# #








# Перевод 2-10
# dvoich='011111001'
# chislo=0
# for i,g in enumerate(dvoich[::-1]):
#     #print(i,g)
#     if g=="1":
#         chislo+=2**i
#     else:
#         pass
# print(chislo)
# Перевод 10-2
# p=[]